<hr/>
<div class="alert alert-danger alertsuccess" style="margin-top: 20px">
<b><h3>Programming exercise 1:</h3></b>
<p>
Print the following code:<br>
<code>Hello, World!</code><br>
<code>Hello, World! I am learning how to code :D</code><br>
</p>
</div>
<hr/>

In [2]:
print("Hello, World!")
print("Hello, World! I am learning how to code :D")

Hello, World!
Hello, World! I am learning how to code :D

<hr/>
<div class="alert alert-danger alertsuccess" style="margin-top: 20px">
<b><h3>Programming exercise 2:</h3></b>
<p>
Defined several variables to calculate the total number of seconds in a year. <br>
<!-- <code>Hello, World!</code><br> -->
<!-- <code>Hello, World! I am learning how to code :D</code><br> -->
</p>
</div>
<hr/>

In [3]:
# Create variables
num_years = 4
days_per_year = 365 
hours_per_day = 24
mins_per_hour = 60
secs_per_min = 60

# Calculate number of seconds in four years
total_secs = secs_per_min * mins_per_hour * hours_per_day * days_per_year * num_years
print(total_secs)

126144000

Use the next code cell to:

- Define a variable births_per_min and set it to 250. (There are on average 250 babies born each minute.)
- Define a variable births_per_day that contains the average number of babies born each day. (To set the value of this variable, you should use births_per_min and some of the variables from the previous code cell.)

In [5]:
births_per_min = 250
births_per_day = births_per_min * mins_per_hour * days_per_year

print(births_per_day)

5475000

<hr/>
<div class="alert alert-danger alertsuccess" style="margin-top: 20px">
<b><h3>Programming exercise 3:</h3></b>
<p>
The Titanic competition is Kaggle's most famous data science competition. In this competition, participants are challenged to build a machine learning model that can predict whether or not passengers survived the Titanic shipwreck, based on information like age, sex, family size, and ticket number.

Run the next code cell without changes to load and preview the titanic data.

Don't worry about the details of the code for now - the end result is just that the all of the titanic data has been loaded in a variable named `titanic_data`.<br>
<!-- <code>Hello, World!</code><br> -->
<!-- <code>Hello, World! I am learning how to code :D</code><br> -->
</p>
</div>
<hr/>

In [6]:
# Load the data from the titanic competition
import pandas as pd
titanic_data = pd.read_csv("titanic/train.csv")

# Show the first five rows of the data
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S